# Imputation of missing values

# a. Simple imputation

i. Simple imputation through mean and median : for numerical features

In [71]:
import seaborn as sb 
df = sb.load_dataset('titanic') 
# Printing the first five rows of the dataset
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [72]:
# check for null values 
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [73]:
# handling null values in age column through simple mean imputation 
df['age'] = df['age'].fillna(df['age'].mean())
# checking for null values in age column 
df['age'].isna().sum()

np.int64(0)

In [74]:
# handling null values in age column through simple median imputation 
df['age'] = df['age'].fillna(df['age'].median()) 
# checking for null values in age column 
df['age'].isna().sum()

np.int64(0)

ii. Simple imputation through mode : for categorical values

In [75]:
# handling null values in deck column through simple mode imputation 
df['deck_mode_imputed'] = df['deck'].fillna(df['deck'].mode()) 
# checking for null values in deck column 
df['deck_mode_imputed'].isna().sum()

np.int64(687)

We were unable to handle the null values in deck column through mode imputation so we gonna drop the entire deck column

In [76]:
# dropping deck column from the dataframe 
df.drop(['deck','deck_mode_imputed'],axis=1,inplace=True)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True